andybi0403/STM32H7-Elderly-Care-System/firmware/module_tests/virtual UI/UI/lcd_ui.c
    if (value == 0) {
        out[0] = '0';
        out[1] = '\0';
        return;
    }

    while (value && i < sizeof(temp)) {
        temp[i++] = (char)('0' + (value % 10U));
        value /= 10U;
    }

    for (uint8_t j = 0; j < i; j++) {
        out[j] = temp[i - 1U - j];
    }
    out[i] = '\0';
}

static void draw_panel(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color)
{
    lcd_fill(x, y, w, h, color);
    lcd_fill(x, y, w, 2, COLOR_GRAY);
    lcd_fill(x, (uint16_t)(y + h - 2), w, 2, COLOR_GRAY);
    lcd_fill(x, y, 2, h, COLOR_GRAY);
    lcd_fill((uint16_t)(x + w - 2), y, 2, h, COLOR_GRAY);
}

static void LCD_UI_UNUSED draw_bar(uint16_t x, uint16_t y, uint16_t w, uint16_t fill, uint16_t color)
{
    lcd_fill(x, y, w, 8, 0xDEFB);
    lcd_fill(x, y, fill, 8, color);
}

static void draw_button(uint16_t x, uint16_t y, uint16_t w, uint16_t h, const char *label, uint8_t active)
{
    uint16_t bg = active ? COLOR_HEADER : COLOR_NAV;
    lcd_fill(x, y, w, h, bg);
    lcd_fill(x, y, w, 1, COLOR_WHITE);
    draw_text((uint16_t)(x + 8U), (uint16_t)(y + 8U), label, COLOR_WHITE, bg, 1);
}

static void draw_num(uint16_t x, uint16_t y, uint16_t value, uint16_t fg, uint16_t bg, uint8_t scale)
{
    char text[6];
    u16_to_dec(value, text);
    draw_text(x, y, text, fg, bg, scale);
}

static void draw_temp(uint16_t x, uint16_t y, int16_t c10, uint16_t fg, uint16_t bg, uint8_t scale)
{
    char text[8];
    uint16_t v = c10 < 0 ? (uint16_t)-c10 : (uint16_t)c10;
    char whole[5];
    char frac[2];

    u16_to_dec((uint16_t)(v / 10U), whole);
    u16_to_dec((uint16_t)(v % 10U), frac);
    uint8_t p = 0;
    if (c10 < 0) text[p++] = '-';
    for (uint8_t i = 0; whole[i] != '\0'; i++) text[p++] = whole[i];
    text[p++] = '.';
    text[p++] = frac[0];
    text[p++] = 'C';
    text[p] = '\0';
    draw_text(x, y, text, fg, bg, scale);
}

static void draw_header(const char *title)
{
    lcd_fill(0, 0, LCD_W, LCD_H, COLOR_BG);
    lcd_fill(0, 0, LCD_W, 30, COLOR_HEADER);
    draw_text(8, 8, title, COLOR_WHITE, COLOR_HEADER, 2);
    draw_text(154, 10, g_ui_data.wifi_connected ? "LINK" : "NO LINK", COLOR_WHITE, COLOR_HEADER, 1);
    if (g_ui_data.alarm_active) {
        lcd_fill(208, 4, 28, 22, COLOR_RED);
        draw_text(214, 11, "A", COLOR_WHITE, COLOR_RED, 1);
    }
}

static void draw_nav(void)
{
    draw_button(0, 286, 60, 34, "HOME", g_current_page == 0);
    draw_button(60, 286, 60, 34, "HEAL", g_current_page == 1);
    draw_button(120, 286, 60, 34, "PILL", g_current_page == 2);
    draw_button(180, 286, 60, 34, "ALRT", g_current_page == 3);
}

static void draw_home(void)
{
    draw_header("ELDER CARE");

    draw_panel(8, 38, 108, 70, COLOR_PANEL);
    draw_text(18, 48, "HEALTH", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(18, 66, g_ui_data.heart_rate, COLOR_RED, COLOR_PANEL, 2);
    draw_text(66, 74, "BPM", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(18, 94, g_ui_data.fall_detected ? "FALL" : "STABLE", g_ui_data.fall_detected ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 1);

    draw_panel(124, 38, 108, 70, COLOR_PANEL);
    draw_text(134, 48, "SPO2", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(134, 66, g_ui_data.spo2, COLOR_BLUE, COLOR_PANEL, 2);
    draw_text(178, 74, "%", COLOR_DARK, COLOR_PANEL, 1);
    draw_temp(134, 94, g_ui_data.temperature_c10, COLOR_GREEN, COLOR_PANEL, 1);

    draw_panel(8, 116, 224, 58, COLOR_PANEL);
    draw_text(20, 128, "PILL BOX", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(20, 148, "SLOT", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(62, 142, g_ui_data.pillbox_slot, COLOR_ORANGE, COLOR_PANEL, 2);
    draw_text(112, 148, g_ui_data.servo_open ? "OPEN" : "READY", g_ui_data.servo_open ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 1);

    draw_panel(8, 182, 224, 92, COLOR_PANEL);
    draw_text(20, 194, "SYSTEM FLOW", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(20, 216, "RTC PILL  HX711", COLOR_BLUE, COLOR_PANEL, 1);
    draw_text(20, 236, "MAX30102  IMU", COLOR_BLUE, COLOR_PANEL, 1);
    draw_text(20, 256, g_ui_data.alarm_active ? "ALARM ACTIVE" : "NORMAL", g_ui_data.alarm_active ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 1);

    draw_nav();
}

static void draw_health(void)
{
    draw_header("HEALTH DETAIL");
    draw_panel(8, 38, 224, 56, COLOR_PANEL);
    draw_text(20, 48, "HEART RATE", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(20, 66, g_ui_data.heart_rate, COLOR_RED, COLOR_PANEL, 2);
    draw_text(72, 74, "BPM", COLOR_DARK, COLOR_PANEL, 1);

    draw_panel(8, 102, 224, 56, COLOR_PANEL);
    draw_text(20, 112, "BLOOD OXYGEN", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(20, 130, g_ui_data.spo2, COLOR_BLUE, COLOR_PANEL, 2);
    draw_text(66, 138, "%", COLOR_DARK, COLOR_PANEL, 1);

    draw_panel(8, 166, 224, 48, COLOR_PANEL);
    draw_text(20, 176, "TEMP", COLOR_DARK, COLOR_PANEL, 1);
    draw_temp(76, 174, g_ui_data.temperature_c10, COLOR_GREEN, COLOR_PANEL, 2);

    draw_panel(8, 222, 224, 52, COLOR_PANEL);
    draw_text(20, 232, "POSTURE", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(20, 252, g_ui_data.fall_detected ? "FALL RISK" : "STABLE", g_ui_data.fall_detected ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 1);
    draw_nav();
}

static void draw_pill(void)
{
    draw_header("PILL DETAIL");
    draw_panel(8, 38, 224, 62, COLOR_PANEL);
    draw_text(20, 48, "NEXT SLOT", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(20, 66, g_ui_data.pillbox_slot, COLOR_ORANGE, COLOR_PANEL, 2);
    draw_text(74, 74, g_ui_data.servo_open ? "OPEN" : "READY", g_ui_data.servo_open ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 1);

    draw_panel(8, 108, 224, 62, COLOR_PANEL);
    draw_text(20, 118, "WEIGHT", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(20, 136, g_ui_data.pill_weight_g, COLOR_BLUE, COLOR_PANEL, 2);
    draw_text(82, 144, "G", COLOR_DARK, COLOR_PANEL, 1);

    draw_panel(8, 178, 224, 96, COLOR_PANEL);
    draw_text(20, 190, "SERVO MG90S", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(20, 212, "PWM 50HZ", COLOR_BLUE, COLOR_PANEL, 1);
    draw_text(20, 232, "0.5 1.5 2.5MS", COLOR_BLUE, COLOR_PANEL, 1);
    draw_text(20, 252, "RTC REMIND OPEN", COLOR_GREEN, COLOR_PANEL, 1);
    draw_nav();
}

