andybi0403/STM32H7-Elderly-Care-System/firmware/module_tests/virtual UI/UI/lcd_ui.c
static void draw_alert(void)
{
    draw_header("ALERT AND DATA");
    draw_panel(8, 38, 224, 72, COLOR_PANEL);
    draw_text(20, 50, "ALARM", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(20, 72, g_ui_data.alarm_active ? "ACTIVE" : "CLEAR", g_ui_data.alarm_active ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 2);
    draw_text(20, 96, "FALL HR SPO2 PILL", COLOR_BLUE, COLOR_PANEL, 1);

    draw_panel(8, 122, 224, 96, COLOR_PANEL);
    draw_text(20, 134, "CAPTURE PORT", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(20, 156, "UI GET FRAME", COLOR_BLUE, COLOR_PANEL, 1);
    draw_text(20, 176, "UART WIFI PACKET", COLOR_GREEN, COLOR_PANEL, 1);

    draw_panel(8, 230, 224, 44, COLOR_PANEL);
    draw_text(20, 244, "PACKET A5 VER DATA SUM", COLOR_DARK, COLOR_PANEL, 1);
    draw_nav();
}

static void draw_page(void)
{
    switch (g_current_page) {
        case 1: draw_health(); break;
        case 2: draw_pill(); break;
        case 3: draw_alert(); break;
        default: draw_home(); break;
    }
    g_needs_redraw = 0;
}

static void touch_write_byte(uint8_t data)
{
    for (uint8_t i = 0; i < 8U; i++) {
        if (data & 0x80U) {
            GPIOE->BSRR = TOUCH_MOSI;
        } else {
            GPIOE->BSRR = (uint32_t)TOUCH_MOSI << 16;
        }

        data <<= 1;
        GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;
        delay_cycles(80);
        GPIOE->BSRR = TOUCH_SCK;
        delay_cycles(80);
    }
}

static uint16_t touch_read_ad(uint8_t cmd)
{
    uint16_t value = 0;

    GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;
    GPIOE->BSRR = (uint32_t)TOUCH_MOSI << 16;
    GPIOE->BSRR = (uint32_t)TOUCH_CS << 16;
    touch_write_byte(cmd);
    delay_cycles(400);

    GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;
    delay_cycles(80);
    GPIOE->BSRR = TOUCH_SCK;
    delay_cycles(80);
    GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;

    for (uint8_t i = 0; i < 16U; i++) {
        value <<= 1;
        GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;
        delay_cycles(80);
        GPIOE->BSRR = TOUCH_SCK;
        if (GPIOE->IDR & TOUCH_MISO) {
            value++;
        }
        delay_cycles(80);
    }

    GPIOE->BSRR = TOUCH_CS;
    return (uint16_t)(value >> 4);
}

static uint16_t touch_read_filtered(uint8_t cmd)
{
    uint16_t min = 0xFFFF;
    uint16_t max = 0;
    uint32_t sum = 0;

    for (uint8_t i = 0; i < 5U; i++) {
        uint16_t v = touch_read_ad(cmd);
        if (v < min) min = v;
        if (v > max) max = v;
        sum += v;
    }

    return (uint16_t)((sum - min - max) / 3U);
}

static uint8_t touch_is_down(void)
{
    return (GPIOD->IDR & TOUCH_PEN) == 0U;
}

static uint8_t touch_read_raw(uint16_t *x, uint16_t *y)
{
    if (!touch_is_down()) {
        return 0;
    }

    *x = touch_read_filtered(0xD0);
    *y = touch_read_filtered(0x90);
    return touch_is_down();
}

static uint16_t clamp_map(uint16_t raw, uint16_t out_max, uint8_t invert)
{
    uint32_t value;

    if (raw < TOUCH_RAW_MIN) raw = TOUCH_RAW_MIN;
    if (raw > TOUCH_RAW_MAX) raw = TOUCH_RAW_MAX;
    value = ((uint32_t)(raw - TOUCH_RAW_MIN) * out_max) / (TOUCH_RAW_MAX - TOUCH_RAW_MIN);
    if (invert) value = out_max - value;
    return (uint16_t)value;
}

static uint8_t touch_read_screen(uint16_t *x, uint16_t *y)
{
    uint16_t raw_x;
    uint16_t raw_y;
    uint16_t sx;
    uint16_t sy;

    if (!touch_read_raw(&raw_x, &raw_y)) {
        return 0;
    }

#if TOUCH_SWAP_XY
    sx = clamp_map(raw_y, LCD_W - 1U, TOUCH_INV_X);
    sy = clamp_map(raw_x, LCD_H - 1U, TOUCH_INV_Y);
#else
    sx = clamp_map(raw_x, LCD_W - 1U, TOUCH_INV_X);
    sy = clamp_map(raw_y, LCD_H - 1U, TOUCH_INV_Y);
#endif

    *x = sx;
    *y = sy;
    return 1;
}

void UI_OnTouch(uint16_t x, uint16_t y, uint8_t pressed)
{
    if (!pressed) {
        return;
    }

    if (y >= 286U) {
        g_current_page = (uint8_t)(x / 60U);
        if (g_current_page > 3U) g_current_page = 3U;
        g_needs_redraw = 1;
        return;
    }

    if (g_current_page == 0U) {
        if (y >= 38U && y <= 108U) {
            if (x < 120U) g_current_page = 1U;
            else g_current_page = 1U;
            g_needs_redraw = 1;
            return;
        }

        if (y >= 116U && y <= 174U) {
            g_current_page = 2U;
            g_needs_redraw = 1;
            return;
        }

        if (y >= 182U && y <= 274U) {
            g_current_page = 3U;
            g_needs_redraw = 1;
        }
    } else if (y < 34U) {
        g_current_page = 0U;
        g_needs_redraw = 1;
    }
}

void UI_Update(const UI_Data_t *data)
{
    if (!data) {
        return;
    }

    g_ui_data = *data;
    g_needs_redraw = 1;
}

uint16_t UI_GetCaptureFrame(uint8_t *buffer, uint16_t buffer_size)
{
    UI_CaptureFrame_t frame;
    const uint8_t *p;
    uint8_t sum = 0;

    if (!buffer || buffer_size < sizeof(frame)) {
        return 0;
    }

    frame.magic = 0xA5;
    frame.version = 1;
    frame.data = g_ui_data;
    frame.checksum = 0;
    p = (const uint8_t *)&frame;
    for (uint16_t i = 0; i < sizeof(frame) - 1U; i++) {
        sum = (uint8_t)(sum + p[i]);
    }
    frame.checksum = sum;

    p = (const uint8_t *)&frame;
    for (uint16_t i = 0; i < sizeof(frame); i++) {
        buffer[i] = p[i];
    }

    return (uint16_t)sizeof(frame);
}

void UI_Init(void)
{
    lcd_bus_init();
    delay_ms(50);

    g_lcd_id = 0x9341;
    lcd_ili9341_init();
    GPIOD->BSRR = GPIO_PIN_15;

    g_current_page = 0;
    g_last_pressed = 0;
    g_needs_redraw = 1;
    draw_page();
}

void UI_FirmwareRun(void)
{
    UI_Init();

    while (1) {
        uint16_t tx = 0;
        uint16_t ty = 0;
        uint8_t pressed = touch_read_screen(&tx, &ty);

        if (pressed) {
            g_last_x = tx;
            g_last_y = ty;
        }

        if (g_last_pressed && !pressed) {
            UI_OnTouch(g_last_x, g_last_y, 1);
        }
        g_last_pressed = pressed;

        if (g_needs_redraw) {
            draw_page();
        }

        GPIOD->BSRR = (uint32_t)GPIO_PIN_14 << 16;
        GPIOC->BSRR = GPIO_PIN_0;
        delay_ms(80);
        GPIOD->BSRR = GPIO_PIN_14;
        GPIOC->BSRR = (uint32_t)GPIO_PIN_0 << 16;
        delay_ms(80);
    }
}
